{
  "source": "Telangana State Women's Development Corporation",
  "lastUpdated": "2023-06-01",
  "schemes": [
    {
      "name": "WE-Hub Incubation Program",
      "type": "Incubation and Mentorship",
      "implementingAgency": "Women Entrepreneurship Hub (WE-Hub)",
      "overview": "WE-Hub is India's first state-led incubator exclusively for women entrepreneurs, established by the Government of Telangana. The incubation program provides comprehensive support to women-led startups at various stages of their entrepreneurial journey. The program offers physical infrastructure, mentorship from industry experts, access to funding networks, market connections, and technical assistance. WE-Hub has supported over 500 women entrepreneurs since its inception in 2018, with a success rate of 65% for businesses continuing beyond three years.",
      "eligibility": "The program is open to women entrepreneurs who are residents of Telangana and have an innovative business idea or an existing business looking to scale. The business should be majority-owned (51% or more) by a woman or a group of women. Applicants must submit a detailed business plan and demonstrate the potential for growth and job creation. Both tech and non-tech ventures are eligible, with special focus on businesses addressing social challenges or leveraging local resources. There is no age limit for applicants, encouraging women of all age groups to pursue entrepreneurship.",
      "benefits": "Selected entrepreneurs receive workspace at subsidized rates, access to shared resources like meeting rooms and high-speed internet, and specialized lab facilities for product development. The mentorship program connects entrepreneurs with industry leaders, successful business owners, and domain experts who provide guidance on business strategy, product development, and market access. Financial support includes seed funding up to ₹10 lakhs for selected ventures, connections to angel investors and venture capital firms, and assistance in applying for government grants. Technical support covers product development, intellectual property rights, legal compliance, and technology adoption. Market access support includes participation in trade fairs, B2B connections, and e-commerce platform integration.",
      "applicationProcess": "Applications for the WE-Hub Incubation Program are accepted twice a year, in January and July. The selection process involves an initial screening of applications, followed by a pitch presentation to a panel of experts. Interested entrepreneurs can apply online through the WE-Hub website (www.wehub.telangana.gov.in) by submitting the application form along with a business plan and supporting documents. Shortlisted candidates are invited for an in-person interview and business pitch. The final selection is based on innovation, market potential, scalability, and the entrepreneur's capability. Selected entrepreneurs sign an incubation agreement for an initial period of one year, which can be extended based on progress."
    },
    {
      "name": "Stree Nidhi Credit Cooperative",
      "type": "Financial Assistance",
      "implementingAgency": "Telangana State Women's Cooperative Development Corporation",
      "overview": "Stree Nidhi Credit Cooperative is a specialized financial institution established to provide timely and affordable credit to women Self-Help Groups (SHGs) in Telangana. The program aims to address the financial needs of women entrepreneurs who often face challenges accessing formal banking services. Stree Nidhi offers loans ranging from ₹25,000 to ₹10 lakhs with simplified procedures and minimal documentation. The cooperative has disbursed over ₹5,000 crores to more than 1.5 million women since its inception, achieving a remarkable repayment rate of 98.7%.",
      "eligibility": "To be eligible for Stree Nidhi loans, applicants must be members of a registered women's Self-Help Group (SHG) that has been operational for at least six months. The SHG should have a good track record of internal lending and repayment. Individual borrowers must be residents of Telangana, aged between 18 and 60 years. The business venture should be owned and operated by the woman applicant. Priority is given to enterprises in manufacturing, services, handicrafts, and agriculture-related activities. Applicants should not have any existing defaulted loans from banks or other financial institutions.",
      "benefits": "Stree Nidhi offers collateral-free loans with interest rates ranging from 8% to 12%, significantly lower than microfinance institutions and informal lenders. Loan processing is completed within 48 hours of application, addressing the critical need for timely credit. The repayment schedule is flexible, with options for weekly, fortnightly, or monthly installments based on business cash flow. Additional benefits include an interest subsidy of 3% for timely repayments, credit life insurance coverage for all borrowers, and business insurance options at subsidized premiums. Borrowers also receive financial literacy training and basic business management guidance through SHG networks.",
      "applicationProcess": "The loan application process begins at the SHG level, where the group recommends members for loans based on their business plans and repayment capacity. The application is then forwarded to the Village Organization (VO) and subsequently to the Mandal Samakhya (MS) for approval. Applications can be submitted through the Stree Nidhi mobile app or at designated centers in each mandal. Required documents include identity proof, address proof, photographs, and a simple business plan. Loan approval typically takes 3-5 days, with disbursement directly to the borrower's bank account. First-time borrowers usually start with smaller amounts, with the loan ceiling increasing based on repayment history."
    },
    {
      "name": "T-PRIDE (Telangana State Program for Rapid Incubation of Dalit Entrepreneurs)",
      "type": "Entrepreneurship Development",
      "implementingAgency": "Telangana Industrial Development Corporation",
      "overview": "T-PRIDE is a comprehensive program designed to promote entrepreneurship among women from SC/ST communities in Telangana. While the program serves both men and women entrepreneurs, it has special provisions for women business owners. The initiative aims to address historical disadvantages faced by these communities by providing financial assistance, skill development, and market access. T-PRIDE has supported the establishment of over 2,000 enterprises owned by SC/ST women entrepreneurs across various sectors including manufacturing, services, and retail.",
      "eligibility": "The program is open to women entrepreneurs from Scheduled Castes (SC) and Scheduled Tribes (ST) who are permanent residents of Telangana. Applicants must have a business idea or an existing business that they wish to expand. The enterprise must be 100% owned by an SC/ST woman or have at least 51% ownership in case of partnerships. The business should have potential for employment generation and sustainable growth. Applicants should have completed at least 10th standard education, though exceptions are made for traditional craft workers with demonstrated skills. The annual family income should not exceed ₹3 lakhs for priority consideration.",
      "benefits": "T-PRIDE offers capital subsidies of up to 45% of project cost for women entrepreneurs (compared to 35% for men), with a maximum limit of ₹1 crore. Interest subsidy of 9% is provided on bank loans for a period of 5 years. The program includes a 100% reimbursement of stamp duty and land registration charges for land purchased for business purposes. Technical and entrepreneurship development training is provided through partnerships with premier institutions like NIMSME and TASK. Marketing support includes mandatory procurement of 20% of government department purchases from T-PRIDE enterprises and subsidized participation in trade fairs. Infrastructure support provides industrial plots and sheds at 50% subsidized rates in industrial parks across Telangana.",
      "applicationProcess": "Applications for T-PRIDE can be submitted online through the Telangana Industrial Development Corporation website (www.tsidc.telangana.gov.in) or at District Industries Centers. The application requires a detailed project report, proof of SC/ST status, identity and address proof, educational certificates, and bank statements. After initial screening, applicants are invited for an interview with the District Selection Committee. Approved projects receive a provisional letter of approval, after which the entrepreneur must arrange the remaining funding through bank loans or self-financing. Once the unit is established, a physical verification is conducted before releasing the subsidy amount. The program also provides handholding support for the first three years of business operation."
    },
    {
      "name": "TSWDC Margin Money Scheme",
      "type": "Financial Assistance",
      "implementingAgency": "Telangana State Women's Development Corporation",
      "overview": "The TSWDC Margin Money Scheme is designed to help women entrepreneurs overcome one of the biggest challenges in starting a business - arranging the initial capital contribution required by banks for business loans. Under this scheme, the Telangana State Women's Development Corporation provides margin money assistance of up to 35% of the project cost, enabling women entrepreneurs to qualify for bank loans more easily. The scheme has benefited over 12,000 women entrepreneurs across Telangana, facilitating the establishment of businesses ranging from small retail outlets to manufacturing units.",
      "eligibility": "The scheme is open to women residents of Telangana who are between 18 and 55 years of age. Applicants should have a viable business proposal that has been approved by a bank for loan financing. The annual family income should not exceed ₹2 lakhs for urban areas and ₹1.5 lakhs for rural areas. Preference is given to women from economically weaker sections, single women, widows, and differently-abled women. The business venture should have potential for sustainable income generation and preferably create employment opportunities for other women. Applicants should have completed at least 8th standard education, though exceptions are made based on business experience and skills.",
      "benefits": "The scheme provides margin money assistance of 35% of the project cost, up to a maximum of ₹5 lakhs. This significantly reduces the entrepreneur's initial capital requirement, as banks typically require 25-40% margin money for MSME loans. The assistance is provided as a conditional grant that converts to a regular grant after successful operation of the business for three years. If the business is established in a rural area or backward district, an additional 5% margin money is provided. The scheme includes mandatory entrepreneurship development training for all beneficiaries, covering business planning, financial management, and marketing strategies. Beneficiaries also receive handholding support for the first two years, including assistance with regulatory compliance, accounting practices, and market linkages.",
      "applicationProcess": "Applications can be submitted to the District Women Development Officer or directly to the TSWDC head office in Hyderabad. The application form is available on the TSWDC website (www.tswdc.telangana.gov.in) and at all District Women Development Offices. Required documents include identity proof, address proof, income certificate, educational certificates, bank approval letter for the business loan, and a detailed project report. Applications are screened at the district level, followed by an interview with the applicant. Approved applications are forwarded to the bank, and the margin money is released directly to the bank account after verification of the business setup. The entire process typically takes 30-45 days from application to fund disbursement."
    },
    {
      "name": "Telangana Industrial Health Clinic",
      "type": "Business Revival",
      "implementingAgency": "Telangana Industrial Development Corporation",
      "overview": "The Telangana Industrial Health Clinic (TIHC) is a specialized program designed to support existing micro and small enterprises facing financial or operational challenges. While not exclusively for women entrepreneurs, the program has a dedicated component for women-owned businesses with enhanced benefits. TIHC provides diagnostic services to identify business problems, financial assistance for revival, and technical support to improve operations. The initiative has successfully revived over 300 women-owned enterprises that were on the verge of closure, preserving approximately 3,000 jobs and assets worth ₹150 crores.",
      "eligibility": "The program is open to existing micro and small enterprises in Telangana that have been operational for at least three years and are currently facing challenges that affect their viability. For women entrepreneurs, the business should have at least 51% ownership by a woman or group of women. The enterprise should have been profitable in the past but currently facing temporary financial or operational difficulties. The business should not be classified as a Non-Performing Asset (NPA) for more than two years. There should be a viable revival plan that can restore the business to profitability within a reasonable timeframe. Priority is given to manufacturing units, export-oriented businesses, and enterprises employing significant numbers of women workers.",
      "benefits": "TIHC provides diagnostic services by expert consultants who analyze the business challenges and recommend revival strategies at no cost to women entrepreneurs. Financial assistance includes soft loans up to ₹10 lakhs at 4% interest (compared to 6% for others) with a repayment period of up to 5 years. The program offers one-time settlement facilitation with existing lenders, helping negotiate reduced payment terms. Technical support includes production process improvements, quality enhancement, technology upgradation, and energy efficiency measures. Marketing assistance helps identify new markets, product diversification opportunities, and e-commerce integration. Women entrepreneurs also receive priority in government procurement and trade fair participation to boost sales during the revival period.",
      "applicationProcess": "Applications can be submitted online through the TIHC portal (www.tihc.telangana.gov.in) or at District Industries Centers. The application requires financial statements for the past three years, details of existing loans and liabilities, a brief description of the challenges faced, and a preliminary revival plan. After initial screening, a TIHC diagnostic team visits the business for detailed assessment. Based on the assessment, a comprehensive revival plan is prepared in consultation with the entrepreneur. The revival plan and financial assistance proposal are presented to the TIHC committee for approval. Once approved, the revival process begins with regular monitoring and support from TIHC consultants. Progress reviews are conducted quarterly until the business returns to sustainable operations."
    }
  ]
}
